#### (1)-

In [2]:
import pandas as pd

In [3]:
s1= pd.Series([4, 8, 15, 16, 23, 42])
s1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#### (2)-

In [4]:
l1= [1, 2, "a", "b", 4, 5, 7, (2,3), "hello", "bhavna"]

In [5]:
pd.Series(l1)

0         1
1         2
2         a
3         b
4         4
5         5
6         7
7    (2, 3)
8     hello
9    bhavna
dtype: object

#### (3)-

In [6]:
d1= {"Name": ["Alice", "Bob", "Claire"],
     "Age": [25,30,27],
     "Gender": ["Female", "Male", "Female"]}

pd.DataFrame(d1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#### (4)-
##### DataFrame in pandas is a 2 dimensional heterogenous tabular data structure with labelled axes- rows and columns
##### Series on the other hand is a 1 dimensional homogenous array. DataFrames are mutable i.e once created new data can be added or dropped, but series are immutable.

In [13]:
d1= {"Name": ["Alice", "Bob", "Claire"],
     "Age": [25,30,27],
     "Gender": ["Female", "Male", "Female"]}

df= pd.DataFrame(d1)

In [14]:
df         # this is the dataframe

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [15]:
df["Name"]      # this is a series

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [16]:
df.drop("Age", axis=1, inplace=True)

In [18]:
df     #mutability of dataframe

     Name  Gender
0   Alice  Female
1     Bob    Male
2  Claire  Female

#### (5)- 
##### Common functions used to manipulate data in pandas DataFrame are- drop(), rename(), iloc[], loc[], select_dtypes(), set_index(), reset_index(), groupby(), Categorical(), apply() etc.
##### Ex-

In [19]:
d1= {"Name": ["Alice", "Bob", "Claire"],
     "Age": [25,30,27],
     "Gender": ["Female", "Male", "Female"]}

df1= pd.DataFrame(d1)

In [20]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [21]:
df1.set_index("Name", inplace=True)       # it will overwrite the default indices with Name column

In [22]:
df1

        Age  Gender
Name
Alice    25  Female
Bob      30    Male
Claire   27  Female

#### (6)-
##### Series is immuatble. DataFrame and panel are mutable.

#### (7)-

In [24]:
s1= pd.Series([4, 8, 15, 16, 23, 42])
s2= pd.Series(["a","b","c","d","e","f"])
s3= pd.Series([1, 2, "bhavna", 3, 4, 5])

dict1= {"key1": s1, "key2": s2, "key3": s3}
pd.DataFrame(dict1)

   key1 key2    key3
0     4    a       1
1     8    b       2
2    15    c  bhavna
3    16    d       3
4    23    e       4
5    42    f       5